### 3.0 소개 [20201011]

데이터 랭글링 = 원본 데이터를 정재하고 사용 가능한 형태로 구성하기 위한 변환 과정을 
광범위하게 의미하는 비공식적인 용어<br>
데이터 전처리의 한 한계

In [2]:
import pandas as pd

url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [3]:
dataframe.tail(5)

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

### 3.1 데이터프레임 만들기

In [8]:
import pandas as pd

dataframe = pd.DataFrame()
dataframe['Name'] = ["Jacky Jackson","Steven Stevenson"]
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

In [9]:
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [11]:
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])

dataframe.append(new_person, ignore_index = True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [13]:
import numpy as np

data = [['Jacky Jackson', 38, True], ['Steven Stevenson',25,False]]

matrix = np.array(data)
pd.DataFrame(matrix, columns=['Name','Age','Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [15]:
pd.DataFrame(data, columns=['Name','Age','Drive'])

               Name  Age  Drive
0     Jacky Jackson   38   True
1  Steven Stevenson   25  False

In [16]:
pd.DataFrame(data, index=['row1','row2'])

                     0   1      2
row1     Jacky Jackson  38   True
row2  Steven Stevenson  25  False

### 3.2 데이터 설명하기

In [18]:
import pandas as pd

url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [19]:
#차원 확인
dataframe.shape

(1313, 6)

In [20]:
#통계값 확인
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

### 3.3 데이터프레임 탐색하기

In [21]:
url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
dataframe = pd.read_csv(url)

#첫번째 행 선택
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [22]:
#세 개의 행
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [23]:
# 4개의 행
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [25]:
#인덱스 설정
#설정 해주면 앞에 숫자는 없어지고 열이었던 Name이 인덱스 자리로 들어옴
dataframe = dataframe.set_index(dataframe['Name'])

In [26]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
"Zakarian, Mr Artun","Zakarian, Mr Artun",3rd,27.00,male,0,0
"Zakarian, Mr Maprieder","Zakarian, Mr Maprieder",3rd,26.00,male,0,0
"Zenni, Mr Philip","Zenni, Mr Philip",3rd,22.00,male,0,0
"Lievens, Mr Rene","Lievens, Mr Rene",3rd,24.00,male,0,0
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.00,male,0,0

In [28]:
# 'Allison, Miss Helen Loraine' 이전까지 행에서 age와 sex 열만 선택
# loc 는 데이터 프레임의 인덱스가 레이블일 때 사용
dataframe.loc['Allison, Miss Helen Loraine', 'Age':'Sex']

Age         2
Sex    female
Name: Allison, Miss Helen Loraine, dtype: object

In [29]:
dataframe[:'Allison, Miss Helen Loraine'] # dataframe[:2]와 동일

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [31]:
dataframe[['Age','Sex']].head(2)

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

### 3.4 조건에 따라 행 선택하기

In [32]:
url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
dataframe = pd.read_csv(url)

dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [33]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [35]:
dataframe[(dataframe['Sex'] == 'male') & (dataframe['PClass'] == '1st')]

,Name,PClass,Age,Sex,Survived,SexCode
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
7,"Andrews, Mr Thomas, jr",1st,39.00,male,0,0
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0,0
...,...,...,...,...,...,...
307,"Hassah, Mr Hamad",1st,NaN,male,0,0
309,"Keeping, Mr Edwin",1st,32.00,male,0,0
312,"Lesneur, Mr Gustave",1st,NaN,male,0,0
316,"Ringhini, Mr Sante",1st,33.00,male,0,0
317,"Robbins, Mr Victor",1st,NaN,male,0,0

### 3.5 값 치환하기

In [36]:
# female을 Woman이라고 바꾸기
dataframe['Sex'].replace("female", "Woman").head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [38]:
dataframe['Sex'].replace(['female','male'],['Woman',"Man"]).head(7)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
5      Man
6    Woman
Name: Sex, dtype: object

In [39]:
dataframe.replace(1,"One").head(2)

                           Name PClass Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29  female      One     One
1   Allison, Miss Helen Loraine    1st   2  female        0     One

In [41]:
# replace 메서드는 정규 표현식 인식 가능

dataframe.replace("1st","First",regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

In [42]:
dataframe.replace(["female","male"],"person").head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  person         1        1
1          Allison, Miss Helen Loraine    1st   2.0  person         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0  person         0        0

In [44]:
dataframe.replace({"female":1,"male":0}).head(3)

                                  Name PClass   Age  Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0    1         1        1
1          Allison, Miss Helen Loraine    1st   2.0    1         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    0         0        0

### 3.6 열 이름 바꾸기

In [45]:
dataframe.rename(columns ={'PClass':'Passanger Class'}).head(2)

,Name,Passanger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [46]:
dataframe.rename(columns ={'PClass':'Passanger Class','Sex':'Gender'}).head(2)

,Name,Passanger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [49]:
#전체 열의 이름을 동시에 바꾸려면 이전 열 이름을 사용하고 값은 비어 있는 딕셔너리를 만드는게 편함
import collections

columns_names = collections.defaultdict(str)

In [51]:
for name in dataframe.columns:
    columns_names[name]

In [52]:
columns_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [56]:
# 인덱스 0을 -1로 바꿈
dataframe.rename(index={0:-1}).head(2)

                            Name PClass   Age     Sex  Survived  SexCode
-1  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
 1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [59]:
dataframe.rename(str.lower, axis='columns').head(2)

                           name pclass   age     sex  survived  sexcode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### 3.7 최솟값, 최댓값, 합, 평균 계산 및 개수 세기

표준편차 = 변수를 측정한 자료에서 구함<br>
표준오차 = 변수를 측정한 자료에서 구한 표본평균의 표준편차

판다스는 분산(var),표준편차(std),첨도(kurt),비대칭도(skew),평균의 표준오차(sem),최빈값(mode),중앙값(median) 등 많은 메서드 제공

In [61]:
print(max(dataframe['Age']))
print(dataframe['Age'].max())

71.0
71.0

In [62]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [63]:
# 수치형 열의 공분산 계산
dataframe.cov()

                 Age  Survived   SexCode
Age       203.320470 -0.430491 -0.382054
Survived   -0.430491  0.225437  0.114070
SexCode    -0.382054  0.114070  0.228230

In [65]:
# 수치형 열의 상관계수
dataframe.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

### 3.8 고유한 값 찾기

unique(), value_unique 는 범주형 열을 탐색하거나 조작할 때 유용

In [66]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [67]:
dataframe['Age'].unique()

array([29.  ,  2.  , 30.  , 25.  ,  0.92, 47.  , 63.  , 39.  , 58.  ,
       71.  , 19.  ,   nan, 50.  , 24.  , 36.  , 37.  , 26.  , 28.  ,
       45.  , 22.  , 41.  , 48.  , 44.  , 59.  , 60.  , 53.  , 33.  ,
       14.  , 11.  , 49.  , 46.  , 27.  , 31.  , 64.  , 55.  , 70.  ,
       69.  , 38.  , 17.  ,  4.  , 23.  , 35.  , 54.  , 21.  , 52.  ,
       16.  , 51.  , 42.  , 40.  , 15.  , 65.  , 18.  , 56.  , 43.  ,
       61.  , 13.  , 34.  ,  6.  , 57.  , 32.  , 62.  , 67.  , 20.  ,
        1.  , 12.  ,  0.83,  8.  ,  7.  ,  3.  ,  0.8 ,  9.  ,  5.  ,
        0.33,  0.17, 10.  ,  1.5 ])

In [68]:
dataframe['Age'].value_counts()

22.00    35
30.00    31
21.00    31
18.00    30
36.00    29
         ..
67.00     1
70.00     1
0.17      1
0.92      1
0.80      1
Name: Age, Length: 75, dtype: int64

In [69]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [71]:
# 고유한 값의 개수만 출력
dataframe['PClass'].nunique()

4

In [72]:
dataframe.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

value_counts, nunique에는 NaN을 카운트할지 여부를 결정하는 dropna 매개변수가 있음 기본값은 True, NaN을 카운트하지 않는다

### 3.9 누락된 값 다루기

In [74]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [76]:
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [79]:
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE',-999])

In [80]:
# NaN 말고 나머지 문자는 NaN 으로 인식하지 않음
dataframe = pd.read_csv(url, na_values = ['female'], keep_default_na=False)
dataframe[12:14]

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [81]:
# na_filter =False 로 설정하면 NaN 변환을 하지 않음
dataframe = pd.read_csv(url, na_filter = False)
dataframe[12:14]

                            Name PClass Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st      female         1        1
13      Barkworth, Mr Algernon H    1st        male         1        0

### 3.10 열 삭제하기 [20201018]

In [2]:
import pandas as pd
url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
dataframe = pd.read_csv(url)

#drop으로 삭제하고 싶은 열을 삭제
dataframe.drop('Age', axis = 1).head(3)

                                  Name PClass     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  female         1        1
1          Allison, Miss Helen Loraine    1st  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st    male         0        0

In [3]:
#여러 열을 한번에 삭제할 수도 있다.
dataframe.drop(['Age','Name'],axis=1).head(2)

  PClass     Sex  Survived  SexCode
0    1st  female         1        1
1    1st  female         0        1

In [4]:
# 열 이름이 없는 경우에는 열 인덱스를 지정하여 삭제가능 (Age열 삭제)
dataframe.drop(dataframe.columns[2],axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

### 3.11 행 삭제하기

In [39]:
# != : bool 형식 피연산자의 값이 같지 않으면 반환
# drop 써도 되지만 불리언 조건을 넣어서 삭제하는 것도 가능
dataframe[dataframe['Sex']!= 'male'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [41]:
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [43]:
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

### 3.12 중복된 행 삭제

In [44]:
# 중복된 행을 삭제하는 함수 : drop_duplicates()
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [46]:
# 그렇지만 실제러 drop_duplicates를 썼을때와 안썼을 때 행의 수 차이는 없다.
# 기본적으로 모든 열이 완벽히 동일한 행만 삭제하기 때문이다.
print("원본 데이터프레임 행의 수 " , len(dataframe))
print("중복 삭제 후 행의 수 :" , len(dataframe.drop_duplicates()))

원본 데이터프레임 행의 수  1313
중복 삭제 후 행의 수 : 1313

In [47]:
# 일부 열만 대상으로 중복된 행을 검사한다. ,subset 매개변수를 사용
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

drop_duplicates 에서 Sex열을 대상으로 검사해 처음에 있는 female과 male을 제외한 나머지 값을 중복으로 취급해서 버렸음. keep 매개변수를 사용해 이러한 방식을 바꿀 수 있다.

In [48]:
dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [50]:
# 중복 여부 확인
dataframe.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

### 3.13 값에 따라 행을 그룹핑하기

In [51]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [52]:
dataframe.groupby('Sex')

In [53]:
dataframe.groupby('Sex')['Name'].count()

Sex
female    462
male      851
Name: Name, dtype: int64

In [54]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

3.14는 교수님이 안하신대 룰루 ~

### 3. 15 열 원소 순회하기

In [5]:
#name : 문자열에 두 개를 대문자로 바꿔서 출력하기
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [7]:
# 반복문 외에 리스트 컴프리헨션을 사용할 수 도 이다.
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [10]:
# 독특한 처리를 할 수 있는 함수 : 판다스의 apply 
def upper(a) :
    return a.upper()
dataframe['Name'].apply(upper)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

apply는 데이터 정제와 랭글링을 하는데 아주 유용함 비슷한 메서드인 map도 있음.
map은 딕셔너리를 입력으로 넣을 수 있고, apply는 매개변수를 지정할 수 있다는 것이 큰 차이다.

In [11]:
dataframe['Survived'].map({1:'Live',0:'Dead'})[:5]

0    Live
1    Dead
2    Dead
3    Dead
4    Live
Name: Survived, dtype: object

### 3.17 그룹에 함수 적용하기

In [14]:
# lambda : 이름 없는 함수 만들기
# 각 그룹에 함수가 적용되고 그 안의 데이터프레임을 매개변수로 작용
dataframe.groupby('Sex').apply(lambda x : x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

### 3.18 ~ 3.19 교수님이 직접 만들어놓은 주피터 파일 필기

In [20]:
import pandas as pd

data_a = {'id':['1','2','3'],'first':['Alex','Asy','Allen'],
          'last':['Anderson','Ackerman','All']}

#columns에 if를 뺀 first랑 last만 뽑을 수도 있다.
#index 지정시 숫자 말고 지정한 값이 나온다. index=['p','q','r']
dataframe_a = pd.DataFrame(data_a,columns=['id','first','last'])


data_b = {'id':['4','5','6'],'first':['Billy','Brian','Bran'],
          'last':['Bonder','Black','Balwner']}

dataframe_b = pd.DataFrame(data_b, columns=['id','first','last'])

In [21]:
dataframe_a.head()

  id  first      last
0  1   Alex  Anderson
1  2    Asy  Ackerman
2  3  Allen       All

In [17]:
dataframe_b.head()

  id  first     last
0  4  Billy   Bonder
1  5  Brian    Black
2  6   Bran  Balwner

### 연결(concatenation)

In [25]:
#데이터 프레임 아래위로 연결한다.
# axis = 0 은 가로축을 기준으로 , 즉 가로측은 고정하고 해석한다.
# ignore_index=True 를 주면 인덱스 값이 새로 붙여진다.
dataframe_ab = pd.concat([dataframe_a, dataframe_b], axis=0)
dataframe_ab

  id  first      last
0  1   Alex  Anderson
1  2    Asy  Ackerman
2  3  Allen       All
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [26]:
dataframe_c = pd.DataFrame(data_b, columns=['first','last'])
dataframe_c

   first     last
0  Billy   Bonder
1  Brian    Black
2   Bran  Balwner

두 데이터프레임을 아래위로 연결할 때는 열 이름을 기준으로 한다. 따라서 결과로 얻어지는 데이터프레임에는 두 데이터프레임에 있는 모든 열이 포함되고 각 데이터프레임 입장에서 새롭게 추가되는 열에는 결측치가 입력된다.

In [27]:
pd.concat([dataframe_a, dataframe_c],axis = 0)

    id  first      last
0    1   Alex  Anderson
1    2    Asy  Ackerman
2    3  Allen       All
0  NaN  Billy    Bonder
1  NaN  Brian     Black
2  NaN   Bran   Balwner

In [28]:
#데이터프레임을 좌우로 연결
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Asy  Ackerman  5  Brian    Black
2  3  Allen       All  6   Bran  Balwner

In [29]:
data_b = {'id':['4','5','6'],'first':['Billy','Brian','Bran'],
          'last':['Bonder','Black','Balwner']}

dataframe_b = pd.DataFrame(data_b, columns=['id','first','last'], index=[2,3,4])

In [30]:
dataframe_b

  id  first     last
2  4  Billy   Bonder
3  5  Brian    Black
4  6   Bran  Balwner

1. 두 데이터프레임을 좌우로 연결할 때는 행의 인덱스가 같은 행끼리 연결한다.<br>
2. 두 데이터프레임 모두에 나타나지 않는 인덱스를 가진 행은 결측치를 가질 수 밖에 없다.

In [31]:
pd.concat([dataframe_a, dataframe_b], axis=1)

    id  first      last   id  first     last
0    1   Alex  Anderson  NaN    NaN      NaN
1    2    Asy  Ackerman  NaN    NaN      NaN
2    3  Allen       All    4  Billy   Bonder
3  NaN    NaN       NaN    5  Brian    Black
4  NaN    NaN       NaN    6   Bran  Balwner

### 데이터프레임 병합(merge)

변수의 열을 기준으로 열의 기준이 같은 것끼리 연결하는 연산

In [33]:

employee_data = {'employee_id':['1','2','3','4'],
                'name':['Amy Jones','Allen Keys','Allce Bees','Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id','name'])

sales_data = {'employee_id':['3','4','5','6'], 'total_sales':[23456,2512,2345,1455]}

dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

In [34]:
dataframe_employees

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Allce Bees
3           4  Tim Horton

In [35]:
dataframe_sales

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [36]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id')

  employee_id        name  total_sales
0           3  Allce Bees        23456
1           4  Tim Horton         2512

In [37]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Allce Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [38]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Allce Bees      23456.0
3           4  Tim Horton       2512.0